Конфигурация/InformationRegisters/НазначенияНастроекОтчетов.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.17">
	<InformationRegister>
		<Properties>
			<Name>НазначенияНастроекОтчетов</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>НастройкаОтчета</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>НастройкаКлиента</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>НастройкаВидаДоговора</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>НастройкаСчетаДоверительногоУправления</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>НастройкаПакета</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>Отчет</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Отчеты</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Настройка</Name>
					<Type>
						<v8:Type>cfg:ChartOfCharacteristicTypesRef.НастройкиОтчетов</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

Конфигурация/InformationRegisters/НазначенияНастроекОтчетов/Ext/RecordSetModule.bsl
Процедура ОбработкаПроверкиЗаполнения(Отказ, ПроверяемыеРеквизиты)

	ЭтоУдалениеЗаписей = (ЭтотОбъект.Количество() = 0);	
	
	Если Не ЭтоУдалениеЗаписей Тогда
			
		Запрос = Новый Запрос(
			"ВЫБРАТЬ РАЗРЕШЕННЫЕ
			|	НаборЗаписей.Отчет КАК Отчет,
			|	НаборЗаписей.Настройка КАК Настройка
			|ПОМЕСТИТЬ _НаборЗаписей
			|ИЗ
			|	&НаборЗаписей КАК НаборЗаписей
			|;
			|
			|////////////////////////////////////////////////////////////////////////////////
			|ВЫБРАТЬ РАЗРЕШЕННЫЕ РАЗЛИЧНЫЕ
			|	_НаборЗаписей.Отчет КАК Отчет
			|ИЗ
			|	_НаборЗаписей КАК _НаборЗаписей
			|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.Отчеты КАК Отчеты
			|		ПО (Отчеты.Ссылка = _НаборЗаписей.Отчет)
			|			И (Отчеты.ЭтоГруппа = ИСТИНА)
			|			И (Отчеты.Родитель <> ЗНАЧЕНИЕ(Справочник.Отчеты.ПустаяССылка))
			|;
			|
			|////////////////////////////////////////////////////////////////////////////////
			|ВЫБРАТЬ РАЗРЕШЕННЫЕ РАЗЛИЧНЫЕ
			|	_НаборЗаписей.Отчет КАК Отчет
			|ИЗ
			|	_НаборЗаписей КАК _НаборЗаписей
			|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.Отчеты КАК Отчеты
			|		ПО (Отчеты.Ссылка = _НаборЗаписей.Отчет)
			|			И (Отчеты.ЭтоГруппа = ЛОЖЬ)
			|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ПланВидовХарактеристик.НастройкиОтчетов КАК НастройкиОтчетов
			|		ПО (НастройкиОтчетов.Ссылка = _НаборЗаписей.Настройка)
			|			И (НастройкиОтчетов.Код В (&НастройкиАвтоматизации))");
		
		НастройкиАвтоматизации = Новый Массив;
		НастройкиАвтоматизации.Добавить("АвтоматическаяОтправка");
		НастройкиАвтоматизации.Добавить("АвтоматическаяВыгрузка");
		НастройкиАвтоматизации.Добавить("АвтоматическаяВыгрузкаВЭДО");
		
		Запрос.УстановитьПараметр("НаборЗаписей",				ЭтотОбъект.Выгрузить(, "Отчет, Настройка"));
		Запрос.УстановитьПараметр("НастройкиАвтоматизации",		НастройкиАвтоматизации);
		
		ПакетПроверок = Запрос.ВыполнитьПакет();
		
		// Настройки группы могут быть заданы только для верхнего уровня	
		
		ПроверкаНастроекГруппы = ПакетПроверок[ПакетПроверок.ВГраница() - 1].Выбрать();
		Пока ПроверкаНастроекГруппы.Следующий() Цикл
			ОбщегоНазначенияКлиентСервер.СообщитьПользователю(
				СтрШаблон("Ошибка назначения настройки для группы отчета '%1': настройки могут быть заданы только для группы отчетов верхнего уровня", ПроверкаНастроекГруппы.Отчет), , , , Отказ);		
		КонецЦикла;
		
		// Настройки автоматизации должны быть только у автоматизированных отчетов
		
		ПроверкаНастроекАвтоматизации = ПакетПроверок[ПакетПроверок.ВГраница()].Выбрать();
		Пока ПроверкаНастроекАвтоматизации.Следующий() Цикл
			Если Не Справочники.Отчеты.ПоддерживаетсяАвтоматическоеФормирование(ПроверкаНастроекАвтоматизации.Отчет) Тогда
				ОбщегоНазначенияКлиентСервер.СообщитьПользователю(СтрШаблон("Автоматическое формирование отчета ""%1"" не реализовано, необходимо обратиться к разработчикам.", ПроверкаНастроекАвтоматизации.Отчет), , "Настройка", "Запись", Отказ);
			КонецЕсли;		
		КонецЦикла;
		
	КонецЕсли;

	// Фиксируем результат проверки	
	
	ЭтотОбъект.ДополнительныеСвойства.Вставить("ОбработкаПроверкиЗаполненияОтказ", Отказ);
	
КонецПроцедуры

Процедура ПередЗаписью(Отказ, Замещение)

	Если Не УниверсальныеМеханизмы.ОбъектМожноЗаписать(ЭтотОбъект, Отказ) Тогда
		Возврат;
	КонецЕсли;
	
	ДобавитьСвязанныеНастройки(Замещение);
		
КонецПроцедуры

Процедура ПриЗаписи(Отказ, Замещение)

	Если Не ЭтотОбъект.ДополнительныеСвойства.УдалениеВСоставеИзмененияНабора Тогда
			
		Запрос = Новый Запрос(
			"ВЫБРАТЬ РАЗРЕШЕННЫЕ
			|	ЗависимостиНастроек.Настройка КАК Настройка,
			|	ЗависимостиНастроек.СвязаннаяНастройка КАК СвязаннаяНастройка
			|ПОМЕСТИТЬ _ЗависимостиНастроек
			|ИЗ
			|	&ЗависимостиНастроек КАК ЗависимостиНастроек
			|;
			|
			|////////////////////////////////////////////////////////////////////////////////
			|ВЫБРАТЬ РАЗРЕШЕННЫЕ
			|	НазначенияНастроекОтчетов.Отчет КАК Отчет,
			|	_ЗависимостиНастроек.Настройка КАК Настройка,
			|	_ЗависимостиНастроек.СвязаннаяНастройка КАК СвязаннаяНастройка
			|ИЗ
			|	РегистрСведений.НазначенияНастроекОтчетов КАК НазначенияНастроекОтчетов
			|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ _ЗависимостиНастроек КАК _ЗависимостиНастроек
			|		ПО _ЗависимостиНастроек.Настройка = НазначенияНастроекОтчетов.Настройка
			|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.НазначенияНастроекОтчетов КАК СвязанныеНастройкиОтчетов
			|		ПО СвязанныеНастройкиОтчетов.Отчет = НазначенияНастроекОтчетов.Отчет
			|			И СвязанныеНастройкиОтчетов.Настройка = _ЗависимостиНастроек.СвязаннаяНастройка 
			|ГДЕ
			|	НазначенияНастроекОтчетов.Отчет В (&Отчеты)
			|	И СвязанныеНастройкиОтчетов.Настройка ЕСТЬ NULL");
			
		Запрос.УстановитьПараметр("Отчеты",					ПолучитьОбрабатываемыеОтчеты());
		Запрос.УстановитьПараметр("ЗависимостиНастроек",	ПланыВидовХарактеристик.НастройкиОтчетов.ПолучитьЗависимостиНастроек());
		
		СвязанныеНастройки = Запрос.Выполнить().Выбрать();
		
		Пока СвязанныеНастройки.Следующий() Цикл
			ОбщегоНазначенияКлиентСервер.СообщитьПользователю(
				СтрШаблон("Отсутствует настройка '%1' отчета '%2', связанная с настройкой '%3'", СвязанныеНастройки.СвязаннаяНастройка, СвязанныеНастройки.Отчет, СвязанныеНастройки.Настройка), , , , Отказ);
		КонецЦикла;
	
	КонецЕсли;
	
КонецПроцедуры

Процедура ДобавитьСвязанныеНастройки(Замещение)
	
	Если ЭтотОбъект.Количество() = 0 Тогда
		Возврат;
	КонецЕсли;
	
	// Запоминаем список зависимостей настроек отчетов
	
	Запрос = Новый Запрос(
		"ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	ЗависимостиНастроек.Настройка КАК Настройка,
		|	ЗависимостиНастроек.СвязаннаяНастройка КАК СвязаннаяНастройка
		|ПОМЕСТИТЬ _ЗависимостиНастроек
		|ИЗ
		|	&ЗависимостиНастроек КАК ЗависимостиНастроек");
	
	Запрос.УстановитьПараметр("ЗависимостиНастроек", ПланыВидовХарактеристик.НастройкиОтчетов.ПолучитьЗависимостиНастроек());
	
	Запрос.МенеджерВременныхТаблиц = Новый МенеджерВременныхТаблиц;
	Запрос.Выполнить();	
	
	// Получаем настройки, связанные с текущими, затем настройки, уже связанные с ними, и так далее,
	// пока связанных настроек больше не будет
	
	Запрос.Текст =
		"ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	НаборНастроек.Отчет КАК Отчет,
		|	НаборНастроек.Настройка КАК Настройка
		|ПОМЕСТИТЬ _НаборНастроек
		|ИЗ
		|	&НаборНастроек КАК НаборНастроек
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	_НаборНастроек.Отчет КАК Отчет,
		|	_ЗависимостиНастроек.СвязаннаяНастройка КАК Настройка,
		|	НастройкиОтчетов.НастройкаОтчета КАК НастройкаОтчета,
		|	НастройкиОтчетов.НастройкаКлиента КАК НастройкаКлиента,
		|	НастройкиОтчетов.НастройкаВидаДоговора КАК НастройкаВидаДоговора,
		|	НастройкиОтчетов.НастройкаСчетаДоверительногоУправления КАК НастройкаСчетаДоверительногоУправления,
		|	НастройкиОтчетов.НастройкаПакета КАК НастройкаПакета
		|ИЗ
		|	_НаборНастроек КАК _НаборНастроек
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ _ЗависимостиНастроек КАК _ЗависимостиНастроек
		|		ПО (_ЗависимостиНастроек.Настройка = _НаборНастроек.Настройка)
		|		ЛЕВОЕ СОЕДИНЕНИЕ _НаборНастроек КАК ДобавляемыеЗависимыеНастройки
		|		ПО (ДобавляемыеЗависимыеНастройки.Отчет = _НаборНастроек.Отчет)
		|			И (ДобавляемыеЗависимыеНастройки.Настройка = _ЗависимостиНастроек.СвязаннаяНастройка)
		|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.НазначенияНастроекОтчетов КАК ИмеющиесяЗависимыеНастройки
		|			ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.НазначенияНастроекОтчетов КАК ЗамещаемыеЗаписи
		|			ПО ЗамещаемыеЗаписи.Отчет = ИмеющиесяЗависимыеНастройки.Отчет
		|				И ЗамещаемыеЗаписи.Настройка = ИмеющиесяЗависимыеНастройки.Настройка
		|				И &ОтборЗамещаемыхЗаписей
		|		ПО (ИмеющиесяЗависимыеНастройки.Отчет = _НаборНастроек.Отчет)
		|			И (ИмеющиесяЗависимыеНастройки.Настройка = _ЗависимостиНастроек.СвязаннаяНастройка)
		|			И ЗамещаемыеЗаписи.Настройка ЕСТЬ NULL		
		|		ЛЕВОЕ СОЕДИНЕНИЕ ПланВидовХарактеристик.НастройкиОтчетов КАК НастройкиОтчетов
		|		ПО (НастройкиОтчетов.Ссылка = _ЗависимостиНастроек.СвязаннаяНастройка)
		|ГДЕ
		|	ДобавляемыеЗависимыеНастройки.Настройка ЕСТЬ NULL
		|	И ИмеющиесяЗависимыеНастройки.Настройка ЕСТЬ NULL
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|УНИЧТОЖИТЬ _НаборНастроек";
	
	// При замещении хранимые с соответствующим отбором записи учитывать не нужно
	
	Если Замещение Тогда
		
		ОтборЗамещаемыхЗаписей = "";
		
		Для Каждого ЭлементОтбора Из ЭтотОбъект.Отбор Цикл
			Если ЭлементОтбора.Использование Тогда
				ОтборЗамещаемыхЗаписей = ОтборЗамещаемыхЗаписей + ?(ПустаяСтрока(ОтборЗамещаемыхЗаписей), "", " И ")
					+ "ЗамещаемыеЗаписи." + ЭлементОтбора.ПутьКДанным + " = &" + ЭлементОтбора.ПутьКДанным;
				Запрос.УстановитьПараметр(ЭлементОтбора.ПутьКДанным, ЭлементОтбора.Значение);
			КонецЕсли;
		КонецЦикла;		
		
		Запрос.Текст = СтрЗаменить(Запрос.Текст, "&ОтборЗамещаемыхЗаписей", ?(ПустаяСтрока(ОтборЗамещаемыхЗаписей), "ИСТИНА", ОтборЗамещаемыхЗаписей)); 
		
	Иначе
		
		Запрос.Текст = СтрЗаменить(Запрос.Текст, "&ОтборЗамещаемыхЗаписей", "ЛОЖЬ");	
		
	КонецЕсли;
	
	СохраняемыйНаборНастроек = ЭтотОбъект.Выгрузить(, "Отчет, Настройка");
	
	Запрос.УстановитьПараметр("НаборНастроек", СохраняемыйНаборНастроек);
	
	СвязанныеНастройки				= Запрос.Выполнить().Выгрузить();
	СохраняемыеСвязанныеНастройки	= СвязанныеНастройки.СкопироватьКолонки();
	
	Пока СвязанныеНастройки.Количество() > 0 Цикл	
		
		// Накапливаем связанные настройки
		
		РаботаСКоллекциями.ТаблицаЗначений_Дополнить(СвязанныеНастройки, СохраняемыйНаборНастроек);
		РаботаСКоллекциями.ТаблицаЗначений_Дополнить(СвязанныеНастройки, СохраняемыеСвязанныеНастройки);
		
		// Ищем новые связи
		
		Запрос.УстановитьПараметр("НаборНастроек", СохраняемыйНаборНастроек);
		
		СвязанныеНастройки = Запрос.Выполнить().Выгрузить();
		
	КонецЦикла;
	
	// Если настройки соответствуют отбору, добавляем их в текущий набор,
	// иначе записываем через отдельный набор записей
	
	Если ЗначениеЗаполнено(СохраняемыеСвязанныеНастройки) Тогда
		
		ДобавляемыеНастройки = СохраняемыеСвязанныеНастройки.СкопироватьКолонки();
		
		Для Каждого СтрокаНастройки Из СохраняемыеСвязанныеНастройки Цикл 
			
			Если (Не ЭтотОбъект.Отбор.Отчет.Использование ИЛИ СтрокаНастройки.Отчет = ЭтотОбъект.Отбор.Отчет.Значение)
				И (Не ЭтотОбъект.Отбор.Настройка.Использование ИЛИ СтрокаНастройки.Настройка = ЭтотОбъект.Отбор.Настройка.Значение)
			Тогда
				ЗаполнитьЗначенияСвойств(ЭтотОбъект.Добавить(), СтрокаНастройки);
			Иначе
				ЗаполнитьЗначенияСвойств(ДобавляемыеНастройки.Добавить(), СтрокаНастройки);
			КонецЕсли;
			
		КонецЦикла;	
		
		Если ДобавляемыеНастройки.Количество() > 0 Тогда
			
			НаборСвязанныхНастроек = РегистрыСведений.НазначенияНастроекОтчетов.СоздатьНаборЗаписей();
			НаборСвязанныхНастроек.Загрузить(ДобавляемыеНастройки);
			НаборСвязанныхНастроек.Записать(Ложь);
			
		КонецЕсли;
		
	КонецЕсли;	
	
КонецПроцедуры

Функция ПолучитьОбрабатываемыеОтчеты()
	
	Если ЭтотОбъект.Отбор.Отчет.Использование Тогда // И ЭтотОбъект.Отбор.Настройка.Использование Тогда
		
		// если установлены отборы, то берем их
		
		ОбрабатываемыеОтчеты = РаботаСКоллекциями.ЗначениеВМассив(ЭтотОбъект.Отбор.Отчет.Значение);	
		
	Иначе
		
		// получаем из базы данных при записи набора,
		// т.к. при удалении записей ЭтотОбъект содержит пустой набор
		
		Запрос = Новый Запрос(
			"ВЫБРАТЬ РАЗРЕШЕННЫЕ РАЗЛИЧНЫЕ
			|	НазначенияНастроекОтчетов.Отчет
			|ИЗ
			|	РегистрСведений.НазначенияНастроекОтчетов КАК НазначенияНастроекОтчетов
			|ГДЕ
			|	ИСТИНА");
			
		Для Каждого ЭлементОтбора Из ЭтотОбъект.Отбор Цикл
			Если ЭлементОтбора.Использование Тогда
				Запрос.Текст = Запрос.Текст + Символы.ПС + Символы.Таб + "И " + ЭлементОтбора.ПутьКДанным + " = &" + ЭлементОтбора.ПутьКДанным;
				Запрос.УстановитьПараметр(ЭлементОтбора.ПутьКДанным, ЭлементОтбора.Значение);
			КонецЕсли;
		КонецЦикла;
		
		ОбрабатываемыеОтчеты = Запрос.Выполнить().Выгрузить().ВыгрузитьКолонку("Отчет");

	КонецЕсли;
	
	Возврат ОбрабатываемыеОтчеты;
	
КонецФункции
